In [51]:
import pandas as pd
from sqlalchemy import create_engine, inspect

In [52]:
USERNAME = "postgres"
PASSWORD = "Flight815"
URL = "localhost"
PORT = 5432
DATABASE = "Project_2_DB"

connection_str = f"postgresql+psycopg2://{USERNAME}:{PASSWORD}@{URL}:{PORT}/{DATABASE}"
print(connection_str)

engine = create_engine(connection_str)

postgresql+psycopg2://postgres:Flight815@localhost:5432/Project_2_DB

In [53]:
# create the inspector and connect to the engine
inspector_gadget = inspect(engine)

tables = inspector_gadget.get_table_names()
for table in tables:
    print(table)
    
    # get all columns in table
    columns = inspector_gadget.get_columns(table)
    for column in columns:
        print(column)
    print()

state
{'name': 'state_id', 'type': INTEGER(), 'nullable': False, 'default': "nextval('state_state_id_seq'::regclass)", 'autoincrement': True, 'comment': None}
{'name': 'state', 'type': VARCHAR(length=5), 'nullable': False, 'default': None, 'autoincrement': False, 'comment': None}

airport
{'name': 'airport_id', 'type': INTEGER(), 'nullable': False, 'default': "nextval('airport_airport_id_seq'::regclass)", 'autoincrement': True, 'comment': None}
{'name': 'airport_code', 'type': VARCHAR(length=5), 'nullable': False, 'default': None, 'autoincrement': False, 'comment': None}
{'name': 'airport_name', 'type': VARCHAR(length=200), 'nullable': False, 'default': None, 'autoincrement': False, 'comment': None}
{'name': 'state_id', 'type': INTEGER(), 'nullable': False, 'default': None, 'autoincrement': False, 'comment': None}
{'name': 'city', 'type': VARCHAR(length=200), 'nullable': False, 'default': None, 'autoincrement': False, 'comment': None}

carrier
{'name': 'carrier_id', 'type': INTEGER(), 'nullable': False, 'default': "nextval('carrier_carrier_id_seq'::regclass)", 'autoincrement': True, 'comment': None}
{'name': 'carrier_code', 'type': VARCHAR(length=5), 'nullable': False, 'default': None, 'autoincrement': False, 'comment': None}
{'name': 'carrier_name', 'type': VARCHAR(length=50), 'nullable': False, 'default': None, 'autoincrement': False, 'comment': None}

delay_data
{'name': 'id', 'type': INTEGER(), 'nullable': False, 'default': "nextval('delay_data_id_seq'::regclass)", 'autoincrement': True, 'comment': None}
{'name': 'year', 'type': INTEGER(), 'nullable': False, 'default': None, 'autoincrement': False, 'comment': None}
{'name': 'month', 'type': INTEGER(), 'nullable': False, 'default': None, 'autoincrement': False, 'comment': None}
{'name': 'carrier_id', 'type': INTEGER(), 'nullable': False, 'default': None, 'autoincrement': False, 'comment': None}
{'name': 'airport_id', 'type': INTEGER(), 'nullable': False, 'default': None, 'autoincrement': False, 'comment': None}
{'name': 'arrival_flights', 'type': DOUBLE_PRECISION(precision=53), 'nullable': True, 'default': None, 'autoincrement': False, 'comment': None}
{'name': 'weather_delay', 'type': DOUBLE_PRECISION(precision=53), 'nullable': True, 'default': None, 'autoincrement': False, 'comment': None}

In [54]:
df = pd.read_csv("Resources/carrier_df.csv")
#df = df.drop("Unnamed: 0", axis=1)
df.head()

             carrier_name carrier_code
0       Endeavor Air Inc.           9E
1  American Airlines Inc.           AA
2    Alaska Airlines Inc.           AS
3         JetBlue Airways           B6
4    Delta Air Lines Inc.           DL

In [55]:
df.to_sql("carrier", engine, index=False, if_exists="append", method="multi")

In [61]:
df2 = pd.read_csv("Resources/state_df.csv")
df2 = df2.drop("index", axis=1)
df2.head()

  state
0    PA
1    GA
2    MA
3    LA
4    NY

In [62]:
df2.to_sql("state", engine, index=False, if_exists="append", method="multi")

In [63]:
df3 = pd.read_csv("Resources/airport_df.csv")
#df3 = df3.drop("Unnamed: 0", axis=1)
df3.head()

,airport_code,airport_name,state,city
0,ABE,Lehigh Valley International,PA,Allentown/Bethlehem/Easton
1,ABY,Southwest Georgia Regional,GA,Albany
2,ACK,Nantucket Memorial,MA,Nantucket
3,AEX,Alexandria International,LA,Alexandria
4,AGS,Augusta Regional at Bush Field,GA,Augusta

In [64]:
statesql= pd.read_sql("select * from state", engine)
statesql.head()

   state_id state
0         1    PA
1         2    GA
2         3    MA
3         4    LA
4         5    NY

In [65]:
df3 = pd.merge(df3, statesql, on="state")
df3 = df3.drop("state", axis=1)
df3.head()

,airport_code,airport_name,city,state_id
0,ABE,Lehigh Valley International,Allentown/Bethlehem/Easton,1
1,PIT,Pittsburgh International,Pittsburgh,1
2,AVP,Wilkes Barre Scranton International,Scranton/Wilkes-Barre,1
3,MDT,Harrisburg International,Harrisburg,1
4,PHL,Philadelphia International,Philadelphia,1

In [66]:
df3.to_sql("airport", engine, index=False, if_exists="append", method="multi")

In [67]:
df4 = pd.read_csv("Resources/delay_data_df.csv")
#df3 = df3.drop("Unnamed: 0", axis=1)
df4.head()

,year,month,carrier_code,carrier_name,airport_code,airport_name,arrival_flights,weather_delay
0,2022,5,9E,Endeavor Air Inc.,ABE,Lehigh Valley International,136.0,0.0
1,2022,5,9E,Endeavor Air Inc.,ABY,Southwest Georgia Regional,91.0,0.0
2,2022,5,9E,Endeavor Air Inc.,ACK,Nantucket Memorial,19.0,0.0
3,2022,5,9E,Endeavor Air Inc.,AEX,Alexandria International,88.0,35.0
4,2022,5,9E,Endeavor Air Inc.,AGS,Augusta Regional at Bush Field,181.0,0.0

In [68]:
carriersql= pd.read_sql("select * from carrier", engine)
carriersql.head()

   carrier_id carrier_code            carrier_name
0           1           9E       Endeavor Air Inc.
1           2           AA  American Airlines Inc.
2           3           AS    Alaska Airlines Inc.
3           4           B6         JetBlue Airways
4           5           DL    Delta Air Lines Inc.

In [69]:
df4 = pd.merge(df4, carriersql, on=['carrier_code', 'carrier_name'])
df4 = df4.drop(['carrier_code', 'carrier_name'], axis=1)
df4.head()

,year,month,airport_code,airport_name,arrival_flights,weather_delay,carrier_id
0,2022,5,ABE,Lehigh Valley International,136.0,0.0,1
1,2022,5,ABY,Southwest Georgia Regional,91.0,0.0,1
2,2022,5,ACK,Nantucket Memorial,19.0,0.0,1
3,2022,5,AEX,Alexandria International,88.0,35.0,1
4,2022,5,AGS,Augusta Regional at Bush Field,181.0,0.0,1

In [70]:
airsql= pd.read_sql("select airport_id, airport_code, airport_name from airport", engine)
airsql.head()

   airport_id airport_code                          airport_name
0           1          ABE           Lehigh Valley International
1           2          PIT              Pittsburgh International
2           3          AVP   Wilkes Barre Scranton International
3           4          MDT              Harrisburg International
4           5          PHL            Philadelphia International

In [71]:
df4 = pd.merge(df4, airsql, on=['airport_code', 'airport_name'])
df4 = df4.drop(['airport_code', 'airport_name'], axis=1)
df4.head()

   year  month  arrival_flights  weather_delay  carrier_id  airport_id
0  2022      5            136.0            0.0           1           1
1  2022      4            132.0            0.0           1           1
2  2022      3            135.0          180.0           1           1
3  2022      2            112.0           15.0           1           1
4  2022      1            119.0           89.0           1           1

In [72]:
df4.to_sql("delay_data", engine, index=False, if_exists="append", method="multi",chunksize=50000)